Revit 2027 API
AdvancedWood.WoodRingThickness Property
 The property labeled "Thickness (cm) of yearly growth ring" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodRingThickness { get; }
Public Shared ReadOnly Property WoodRingThickness As String
	Get
public:
static property String^ WoodRingThickness {
	String^ get ();
}
static member WoodRingThickness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDistance".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace